#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ТекДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = ("Изменилось количество");
	Сообщение.Сообщить();
	фрагмент(ТекДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	ТекДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = ("Изменилась цена");
	Сообщение.Сообщить();
	фрагмент(ТекДанные);
		
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура фрагмент(ТекДанные)
	ТекДанные.Сумма = ТекДанные.Цена * ТекДанные.Количество;
КонецПроцедуры
#КонецОбласти
